$(function () {
    //display manufacture date when page is loaded
    var y = new Date().getFullYear();
    for (var i = y; i > 1969; i--) {
      $('#manufacture_date').append('<option value="' + i + '">' + i + '</option>');
    }
  
  });
  
  /********************************
   * this function is used to fetch 
   * related cars mark form DB
   * when the company selected
   * 
   * it uses company id 
   * ******************************/
  $('#company').on('change',function(){
    $id = $(this).val();
    $.ajax({
      type : 'get',
      url  : '{{ URL::to("getMark") }}',
      data :  {'company_id':$id},
      success:function(data){
        $('#mark').html(data);
      }
    });
  });
  

  /* function choseMark(company, mark) {
    var company = document.getElementById(company);
    var mark = document.getElementById(mark);
  
    mark.innerHTML = "";
  
    if (company.value == "هيونداي") {
      var markArray = ["|", "إلنترا | إلنترا", "اتوس | اتوس", "ازيرا | ازيرا", "اكسنت | اكسنت", "اي 10 | اي 10", "اي 20|اي 20", "توكسن | توكسن", "تيركان | تيركان", "جالوبر | جالوبر", "جيتز | جيتز", "جينيسيس | جينيسيس ", "سنتافي | سنتافي ", "سوناتا | سوناتا", "فوليستر |فوليستر ", "فيراكروز |فيراكروز ", "فيرنا |فيرنا ", "كليك |كليك ", "لافيتا |لافيتا ", "ستاريكس |ستاريكس ", "كريز | كريز", "اخرى | اخرى"];
    }
  
    if (company.value == "تويوتا") {
      var markArray = ["|", "برادو |برادو ", "تاكوما |تاكوما ", "أف جي كروزر|أف جي كروزر ", "توندرا |توندرا ", "RAV-4  | RAV-4  ", "فورتشنر |فورتشنر ", "كامري |كامري ", "كريسدا |كريسدا ", "كورولا |كورولا ", "كورونا |كورونا ", "لاند كروزر |لاند كروزر ", "هايلاندر |هايلاندر ", "هايلكس |هايلكس ", "يارس |يارس ", "يارس سيدان |يارس سيدان ", "برويس |برويس ", "اخرى | اخرى"];
    }
  
    if (company.value == "كيا") {
  
      var markArray = ["|", "اوبتيما | اوبتيما", "برايد |برايد ", "بيكانتو |بيكانتو ", " سورنتو | سورنتو", "اسبورتاج | اسبورتاج ", "ريو | ريو ", "سيراتو |سيراتو ", "فيستو |فيستو ", "كادينيزا |كادينيزا ", "كرنفال |كرنفال ", "موهافي |موهافي ", "اخرى | اخرى"];
    }
  
    if (company.value == 'ميتسوبيشي') {
      var markArray = ["|", "آوتلاندر|آوتلاندر ", "باجيرو |باجيرو ", "باجيرو سبورت |باجيرو سبورت ", "لانسر |لانسر ", "لانسر ايفليوشن |لانسر ايفليوشن ", "ماجنا |ماجنا ", "ميراج |ميراج ", "كارسما | كارسما", "اخرى | اخرى"];
    }
  
    if (company.value == 'مرسيدس بنز') {
      var markArray = ["|", "دبليو123 | دبليو 123", "دبليو 124|دبليو 124", "دبلو 190|دبلو 190", "c-class |c-class", "سي ال ايه cla  |سي ال ايه cla ", "سي ال اس cls  |سي ال اس cls  ", "اي كلاس e-class  |اي كلاس e-class  ", "جي كلاس g-class|جي كلاس g-class", "جي ال كيه glk |جي ال كيه glk ", "اس كلاس s-class |اس كلاس s-class ", "سي ال كيه slk|سي ال كيه slk", "جي ال ايه gla |جي ال ايه gla ", " جي ال سي glc | جي ال سي glc ", "اخرى | اخرى"];
    }
  
    if (company.value == 'دايهاتسو') {
      var markArray = ["|", "	سيريون |سيريون ", "ماتيريا |ماتيريا ", "تيرويوس |تيرويوس ", "أخري |أخري "];
    }
  
    if (company.value == 'سكودا') {
      var markArray = ["|", "	أوكتافيا| أوكتافيا", "رومستر |رومستر ", "سوبرب |سوبرب ", "فابيا |فابيا ", "رابيد |رابيد ", "يتي |يتي ", "كودياك |كودياك ", "كاروك |كاروك ", "اخرى | اخرى"];
    }
  
  
    if (company.value == "نيسان") {
  
      var markArray = ["|", "سيدان|سيدان", "نوت|نوت", "سينترا|سينترا", "التما|التما", "ارمادا|ارمادا ", "التيما |التيما ", "أكس تريل |أكس تريل ", "باترول |باترول ", "باثفايندر |باثفايندر ", "تيدا |تيدا ", "داتسون |داتسون ", "سيما |سيما ", "صني |صني ", "كاشاكي |كاشاكي ", "ماكسيما |ماكسيما ", "مورانو |مورانو ", "ميكرا |ميكرا ", "نافارا |نافارا ", "باترول بيك آب |باترول بيك آب ", "سنترا |سنترا "];
    }
  
    if (company.value == "بي واي دي") {
      var markArray = ["|", "اف 0|اف 0", "ال 3 |ال 3 ", "اف 3|اف 3", "اس 6|اس 6", "اخري |اخري "];
    }
  
    if (company.value == "بي ام دبليو") {
      var markArray = ["|", "الفئة 1| الفئة 1", "الفئة 2| الفئة 2", "الفئة 3| الفئة 3", "الفئة 4| الفئة 4", "الفئة 5|الفئة 5", "الفئة 6| الفئة 6", "الفئة 7| الفئة 7", "الفئة 8| الفئة 8", "اكس 3| اكس 3", "اكس 5| اكس 5", "اكس 6| اكس 6", "زد1|زد1", "زد 2| زد 2", "زد 3| زد 3", "اي 200 | اي 200", "اي 225 | اي 225", , "اي 250 | اي 250", "اي 300 | اي 300", "اي 320 | اي 320", "اي 325 | اي 325", "اي 740 | اي 740", "اي 745 | اي 745", "اي 750 | اي 750", "اخرى | اخرى"];
    }
  
    if (company.value == 'هوندا') {
      var markArray = ["|", "سيتي|سيتي ", "سيفيك |سيفيك ", "cr-v|cr-v", "اكورد |اكورد ", "اخرى | اخرى"];
    }
  
    if (company.value == 'لكزس') {
      var markArray = ["|", "ال اس | ال س", "اي اس|اي اس", "جي اس |جي اس ", "|جي اكس |جي اكس ", "ال اكس | ال اكس", "اخرى | اخرى"];
    }
  
    if (company.value == 'فلكسفاجن ') {
      var markArray = ["|", "باسات | باسات ", "بورا |بورا ", "بيتل |بيتل ", "طوراق |طوراق ", "تيغوان |تيغوان ", "جيتا |جيتا ", "غولف |غولف ", "أرتيون |أرتيون ", "تيرامونت |تيرامونت ", "اخرى | اخرى"];
    }
  
    if (company.value == 'سوزوكي') {
      var markArray = ["|", "التو k10 | التو k10", "التو 800|التو 800", "سويفت |سويفت ", "جيمني |جيمني ", "فيتارا |فيتارا ", "APV|APV", "كاري |كاري ", "سياز |سياز ", "بالينو |بالينو ", "إرتيغا |إرتيغا ", "سيليريو |سيليريو ", "اخرى | اخرى"];
    }
  
    if (company.value == 'ايسوزو') {
      var markArray = ["|", "دماكس|دماكس ", "داينا |داينا ", "ان بي ار |ان بي ار ", "ان كيو ار |ان كيو ار ", "ان ار ار |ان ار ار ", "اف تي ار |اف تي ار ", "اخرى|اخرى"];
    }
    if (company.value == "جيب") {
  
      var markArray = ["|", " كومباس | كومباس", "شيروكي|شيروكي|", "رينجر | رينجر"];
    }
    for (var marks in markArray) {
      var pair = markArray[marks].split("|");
      var newMarks = document.createElement("option");
      newMarks.value = pair[0];
      newMarks.innerHTML = pair[1];
      mark.options.add(newMarks);
    }
  } */
  
  
  
  
  